package org.test.map;

import com.google.common.collect.Lists;

import java.util.HashMap;
import java.util.List;


public class TeamNameMap {
    //teamName  teamId
    public static HashMap<String, String> teamNameMap = new HashMap();

    static {
        List<String> list = Lists.newArrayList(
                "860517327@qq.com",
                "454176969@qq.com",
                "1005033118@qq.com",
                "wangsiyucumt@163.com",
                "guodan1994@163.com",
                "910956309@qq.com",
                "616328384@qq.com",
                "18487148756@163.com",
                "2238449103@qq.com",
                "生态文明传播协会",
                "京师水卫士团队",
                "碧水小分队",
                "绿色生活环保协会",
                "乐水行",
                "水行姑苏",
                "水美金陵",
                "华农绿协",
                "南京大学",
                "青年志愿者协会环保项目部",
                "绿色地球协会",
                "环境学院天津测水团队",
                "百里纷兰环保社团",
                "广西农村生活饮用水卫生现况及干预措施调研团队",
                "上善若水",
                "RUC环境学院志愿服务委员会",
                "环境保护协会",
                "水之言",
                "涉外学院-“绿源”保护协会",
                "绿队",
                "黑苹果青年",
                "环境学院青年志愿者工作部",
                "追水之旅",
                "“绿源”保护协会",
                "Enactus创行",
                "学生绿色协会",
                "水宝宝的梦",
                "环境保护协会",
                "溯源保护母亲河协会",
                "陕西筑梦公益发展中心",
                "香樟流萤水情检测计划",
                "新晃侗族自治县水质及用水习惯变迁的研究",
                "“金城水关”少数民族水调查小组",
                "西电水质监测队",
                "绿色畅想@承诺自然",
                "南京大学环境学院",
                "绿领人",
                "碧水行动协会",
                "生命科学学院",
                "呆呆小分队",
                "古冰帽水质调查队",
                "丝路水语",
                "南疆西域水情调研团",
                "思源寻根队",
                "IntoTheClouds",
                "The sawater",
                "化环团委",
                "爱水爱生活",
                "逆流而上",
                "水转千还",
                "大连城乡结合部黑臭水体及饮用水调查研究小组",
                "OUR EARTH,OUR H2O",
                "蒲公英乐水行",
                "紫馨支教队",
                "乐水营",
                "达尔文协会丝绸之路经济带沿线水调查小组",
                "蜜蜂的家小太阳队",
                "环保公益会畅想蔚蓝团队",
                "探路者调研队",
                "青年志愿者协会吾水计划调研组",
                "小树林陕西队“水话安康”陕西省安康市水质调研团",
                "爱心协会星火支教团",
                "绿色使者志愿者协会水资源小组",
                "小壕兔",
                "云南护山卫士",
                "选项1"
        );
        for (int i = 0; i < list.size(); i++) {
            teamNameMap.put(list.get(i), (i + 1) + "");
        }
    }
}
